It is the process of joining 2 or more dataframes

In [1]:
import pandas as pd

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel\parentpoller.py:116: UserWarning: Parent poll failed.  If the frontend dies,
                the kernel may be left running.  Please let us know
                about your system (bitness, Python, etc.) at
                ipython-dev@scipy.org
  ipython-dev@scipy.org""")

In [2]:
#Creating a dataframe
india_weather=pd.DataFrame({
    "city":["mumbai","delhi","bangalore"],
    "humidity":[80,60,78],
    "temperature":[32,45,30]
})
india_weather

        city  humidity  temperature
0     mumbai        80           32
1      delhi        60           45
2  bangalore        78           30

In [3]:
#creating another dataframe
us_weather=pd.DataFrame({
    "city":["new york","california","texas"],
    "humidity":[85,78,65],
    "temperature":[25,30,45]
})
us_weather

         city  humidity  temperature
0    new york        85           25
1  california        78           30
2       texas        65           45

In [6]:
#Concatinating the 2 dataframes
df=pd.concat([india_weather,us_weather])
df
#but here we can notice that the index is not orderly arranged

         city  humidity  temperature
0      mumbai        80           32
1       delhi        60           45
2   bangalore        78           30
0    new york        85           25
1  california        78           30
2       texas        65           45

In [8]:
#To set the index in a proper way, we use ignore_index
df=pd.concat([india_weather,us_weather],ignore_index=True)
df

         city  humidity  temperature
0      mumbai        80           32
1       delhi        60           45
2   bangalore        78           30
3    new york        85           25
4  california        78           30
5       texas        65           45

In [10]:
#to set the key values,
df=pd.concat([india_weather,us_weather],keys=["India","US"])
df

               city  humidity  temperature
India 0      mumbai        80           32
      1       delhi        60           45
      2   bangalore        78           30
US    0    new york        85           25
      1  california        78           30
      2       texas        65           45

In [11]:
# To get the values of India, use loc operator
df.loc["India"]

        city  humidity  temperature
0     mumbai        80           32
1      delhi        60           45
2  bangalore        78           30

In [12]:
df.loc["US"]

         city  humidity  temperature
0    new york        85           25
1  california        78           30
2       texas        65           45

In [16]:
#Creating a new dataframe
temperature_df=pd.DataFrame({
     "city":["mumbai","delhi","bangalore"],
     "temperature":[32,45,30]
 })
temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2  bangalore           30

In [17]:
#Creating a new dataframe
windspeed_df=pd.DataFrame({
    "city":["mumbai","delhi","bangalore"],
     "windspeed":[5,15,10]
})
windspeed_df

        city  windspeed
0     mumbai          5
1      delhi         15
2  bangalore         10

In [18]:
#Concatinating
df=pd.concat([temperature_df,windspeed_df])
df

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

        city  temperature  windspeed
0     mumbai         32.0        NaN
1      delhi         45.0        NaN
2  bangalore         30.0        NaN
0     mumbai          NaN        5.0
1      delhi          NaN       15.0
2  bangalore          NaN       10.0

In [19]:
# But here i need the 2 dataframes to be added at the columns, use axis command
df=pd.concat([temperature_df,windspeed_df],axis=1)
df

        city  temperature       city  windspeed
0     mumbai           32     mumbai          5
1      delhi           45      delhi         15
2  bangalore           30  bangalore         10

In [21]:
#creating another dataframe
windspeed1_df=pd.DataFrame({
    "city":["delhi","mumbai"],
     "windspeed":[15,5]
})
windspeed1_df

     city  windspeed
0   delhi         15
1  mumbai          5

In [23]:
#Concatinating temperature_df and windspeed1_df we get data but the rows are not properly matched
df=pd.concat([temperature_df,windspeed1_df],axis=1)
df

        city  temperature    city  windspeed
0     mumbai           32   delhi       15.0
1      delhi           45  mumbai        5.0
2  bangalore           30     NaN        NaN

In [27]:
#to correct this we need to use index
#Creating a new dataframe
temperature_df1=pd.DataFrame({
     "city":["mumbai","delhi","bangalore"],
     "temperature":[32,45,30]
 },index=[0,1,2])
temperature_df1

        city  temperature
0     mumbai           32
1      delhi           45
2  bangalore           30

In [31]:
#creating another dataframe
windspeed2_df=pd.DataFrame({
    "city":["delhi","mumbai"],
     "windspeed":[15,5]
},index=[1,0])
windspeed2_df

     city  windspeed
1   delhi         15
0  mumbai          5

In [32]:
#COncatinating both with index values
df=pd.concat([temperature_df1,windspeed2_df],axis=1)
df

        city  temperature    city  windspeed
0     mumbai           32  mumbai        5.0
1      delhi           45   delhi       15.0
2  bangalore           30     NaN        NaN

In [33]:
#Concatinating a dataframe with a series
temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2  bangalore           30

In [34]:
s=pd.Series(["Rain","Sunny","Snow"],name="event")
s

0     Rain
1    Sunny
2     Snow
Name: event, dtype: object

In [38]:
df=pd.concat([temperature_df,s],axis=1)
df

        city  temperature  event
0     mumbai           32   Rain
1      delhi           45  Sunny
2  bangalore           30   Snow